0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    chute_master
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    chute_slave
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    
    minx-mesh-wedge
    {
        type            symmetry;
    }
    maxx-mesh-wedge
    {
        type            symmetry;
    }
    minx-mesh-chutesphere
    {
        type            symmetry;
    }
    maxx-mesh-chutesphere
    {
        type            symmetry;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    maxy
    {
    	type            slip;
    }
}


// ************************************************************************* //
