0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform $turbulentEpsilon;

boundaryField
{
    chute_master
    {
        type            epsilonWallFunction;
        value           uniform $turbulentEpsilon;
    }
    chute_slave
    {
        type            epsilonWallFunction;
        value           uniform $turbulentEpsilon;
    }
    
    minx-mesh-wedge
    {
        type            symmetry;
    }
    maxx-mesh-wedge
    {
        type            symmetry;
    }
    minx-mesh-chutesphere
    {
        type            symmetry;
    }
    maxx-mesh-chutesphere
    {
        type            symmetry;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform $turbulentEpsilon;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform $turbulentEpsilon;
        value           $internalField;
    }
    maxy
    {
    	type            slip;
    }
}


// ************************************************************************* //
