system/meshQualityDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshQualityDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// NOTES:
// When checking mesh quality, the only ones that really matter are those that
// are seen with "checkMesh", the extra checks done using "-allGeometry" and
// "allTopology" are outdated. They used to be important, but have since become
// less influencial on the solver stability / accuracy.
// Most important are nonOrtho, skewness, volume, face pyramids, aspect ratio,
// in that order (roughly).

//- Maximum non-orthogonality allowed. Set to 180 to disable.
maxNonOrtho 65; // was 65

//- Max skewness allowed. Set to <0 to disable.
maxBoundarySkewness 10; // was 10
maxInternalSkewness 4; // was 4

//- Max concaveness allowed. Is angle (in degrees) below which concavity
//  is allowed. 0 is straight face, <0 would be convex face.
//  Set to 180 to disable.
maxConcave 80; // was 80

//- Minimum pyramid volume. Is absolute volume of cell pyramid.
//  Set to a sensible fraction of the smallest cell volume expected.
//  Set to very negative number (e.g. -1E30) to disable.
minVol 1e-20; // was 1e-13

//- Minimum quality of the tet formed by the face-centre
//  and variable base point minimum decomposition triangles and
//  the cell centre. Set to very negative number (e.g. -1E30) to
//  disable. YELLOW
//     <0 = inside out tet,
//      0 = flat tet
//      1 = regular tet
minTetQuality 1e-20; // was 1e-13

//- Minimum face area. Set to <0 to disable.
minArea 1e-16; // was 1e-11

//- Minimum face twist. Set to <-1 to disable. dot product of face normal
//  (itself the average of the triangle normals)
//  and face centre triangles normal.
minTwist 0.02; // was 0.02

//- Minimum normalised cell determinant. This is the determinant of all
//  the areas of internal faces. It is a measure of how much of the
//  outside area of the cell is to other cells. The idea is that if all
//  outside faces of the cell are 'floating' (zeroGradient) the
//  'fixedness' of the cell is determined by the area of the internal faces.
//  1 = hex, <= 0 = folded or flattened illegal cell.
//  
//  After much investigation, it seems like no-one cares about minDeterminant.
//  So, just make sure it's not less than zero, and you should be fine.
minDeterminant 1e-3; // was 1e-3

//- Relative position of face in relation to cell centres (0.5 for orthogonal
//  mesh) (0 -> 0.5)
minFaceWeight 0.05; // was 0.05

//- Volume ratio of neighbouring cells (0 -> 1)
minVolRatio 0.01; // was 0.01

//- Per triangle normal compared to that of preceding triangle. Must be >0
//  for Fluent compatibility.
minTriangleTwist -1;


//- If >0 : preserve cells with all points on the surface if the
//  resulting volume after snapping (by approximation) is larger than
//  minVolCollapseRatio times old volume (i.e. not collapsed to flat cell).
//  If <0 : delete always.
//minVolCollapseRatio 0.5; // was 0.1


// ************************************************************************* //
